---
kind: property
id: P:Autodesk.Revit.Creation.FamilyInstanceCreationData.Axis
zh: 轴、x轴、y轴、z轴
source: html/16479a95-62a3-938f-5f9d-53d5fab32089.htm
---
# Autodesk.Revit.Creation.FamilyInstanceCreationData.Axis Property

**中文**: 轴、x轴、y轴、z轴

Get or set the axis of the FamilyInstance

## Syntax (C#)
```csharp
public Line Axis { get; set; }
```

## Remarks
The element property will be the axis while performing the rotation.